app/controllers/checklists_controller.rb

SELECT "checklists".* FROM "checklists"
---
  def index
    @checklists = Checklist.find(:all)
    @checklists.map{|k,v| k.photo_file_name = k.photo.url }

SELECT "checklists".* FROM "checklists" WHERE "checklists"."id" = ? LIMIT 1  [["id", "7"]]
---
  def show
    @checklist = Checklist.find(params[:id])

SELECT "checklists".* FROM "checklists" WHERE "checklists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @checklist = Checklist.find(params[:id])

INSERT INTO "checklists" ("comments", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @checklist = Checklist.new(:photo=> params["photo"],:title => params["title"],:comments => params["comments"])

    respond_to do |format|
      if @checklist.save

SELECT "checklists".* FROM "checklists" WHERE "checklists"."id" = ? LIMIT 1  [["id", "17"]]
UPDATE "checklists" SET "comments" = 'Backbone attachment update', "updated_at" = '2013-03-13 22:35:02.759798' WHERE "checklists"."id" = 16
---
  def update
    @checklist = Checklist.find(params[:id])

    respond_to do |format|
      if @checklist.update_attributes(params[:checklist])

SELECT "checklists".* FROM "checklists" WHERE "checklists"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "checklists" WHERE "checklists"."id" = ?  [["id", 3]]
---
  def destroy
    @checklist = Checklist.find(params[:id])
    @checklist.destroy